#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт  
	
	//-Сухицкий 23.06.2024 - Создаем элемент "Контакное лицо" на форме документов;
	// добавляем кнопку "Пересчитать таблицу" и команду "Д_ПересчитатьТаблицу" в документ ЗаказПокупателя; 
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);	
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаВлево(Форма);	
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);	
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);	
	КонецЕсли;   
	//+Сухицкий
КонецПроцедуры 


#КонецОбласти  

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) 
	//-Сухицкий 23.06.2024 - добавляем элемент "Контактное лицо" в группу 
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";  
	//+Сухицкий
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	//-Сухицкий - Вставляем элемент "Контактное лицо" на форму перед реквизитом СуммаДокумента
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	//+Сухицкий
КонецПроцедуры 

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаВлево(Форма) 
	//Создаем вложенную группу в группу ГруппаШапкаЛево
	НоваяГруппаШапкаЛево = Форма.Элементы.Добавить("НоваяГруппа", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	НоваяГруппаШапкаЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаШапкаЛево.ОтображатьЗаголовок = Ложь;
	НоваяГруппаШапкаЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	//Создаем элемент на форме "Согласованная скидка" во вложенной группе "НоваяГруппа" и добавляем действие "ПриИзменении"
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), НоваяГруппаШапкаЛево);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "Д_СогласованнаяСкидкаПриИзменении");
	
	//Создаем общую команду 
	НоваяКнопка = Форма.Команды.Добавить("Д_ПересчитатьТаблицу");
	НоваяКнопка.Заголовок = "Пересчитать таблицу";
    НоваяКнопка.Действие = "Д_ПересчитатьТаблицу";
	
	//Создаем кнопку на форме "Пересчитать таблицу" во вложенной группе "НоваяГруппа"
	НовыйЭлемент = Форма.Элементы.Добавить("Кнопка", Тип("КнопкаФормы"), НоваяГруппаШапкаЛево);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "Д_ПересчитатьТаблицу"; 

	
КонецПроцедуры 


	
#КонецОбласти